{
    "name": "Procedural Grammar Editor",
    "client": "Square Enix (NDA)",
    "company": "Atlas (Design Partner)",
    "media": "Digital",
    "platform": "PC",
    "involvement": "Pipeline/Tool Development",
    "impact": "Designed and developed a standalone interactive grammar editor that transformed procedural building authoring from manual text editing into an intuitive visual workflow, producing data assets that integrated directly into Unreal procedural pipelines.",
    "responsibilities": [
      "Solely architected and implemented the entire standalone Qt application from scratch using Python and custom 3D components.",
      "Built an interactive grammar authoring environment that visualized modular building rules and let designers construct, modify, and preview structures in real time.",
      "Developed a custom 3D preview system to reflect grammar changes immediately, enabling designers to rapidly iterate on procedural building designs.",
      "Engineered export functionality that converted grammar definitions into spreadsheet data tables consumable by Unreal Engine’s data table system.",
      "Managed all application logic, UI/UX, and integration flow to ensure a cohesive and usable experience for environment design teams."
    ],
    "context": "This tool was created as a prototype for a Square Enix design partner to streamline procedural building workflows. It provided a visual grammar editing interface that replaced cumbersome manual text editing and connected procedural rules to the downstream Unreal pipeline via generated data tables.",
    "challenges": "Manually authoring procedural grammars was error-prone and unintuitive for environment designers, and a visual editing paradigm was needed. Additionally, visually previewing grammar results in real time required a custom interactive 3D system that could reflect grammar changes as designers updated rules.",
    "solutions": "I developed a Qt-based editor that presented grammar components and modular building icons, allowing designers to interactively build and customize structures. Alongside this, I implemented a real-time 3D preview system and an export path that produced spreadsheet data tables for direct consumption by the Unreal procedural pipeline. While the project was not fully deployed due to external shifts in organizational priorities, it demonstrated an intuitive and practical workflow prototype.",
    "portfolioitems": [
      "squareenix-grammar-editor"
    ]
  }